alplabai/alp-sdk/examples/v2n/v2n-gd32-bridge-hil-soak/src/main.c
    /* One-shot probes that must NOT loop: the DSP chain pool holds 4
     * chains and has no close opcode yet, so a per-cycle open would
     * exhaust it by cycle 5 and poison the stats.  Probe once, log,
     * move on -- full chain coverage belongs to the wave-2 DSP work. */
    {
        uint8_t            chain_id = 0xFF;
        const alp_status_t s        = gd32g553_adc_dsp_chain_open(&ctx, &chain_id);
        printf("[hil-soak] one-shot adc_dsp_chain_open -> %d (chain %u)\n", (int)s, chain_id);
    }

    /* ---- the soak proper ---- */
    uint32_t cycle                  = 0;
    uint32_t consecutive_ping_fails = 0;

    for (;;) {
        ++cycle;
        unsigned cycle_pass = 0, cycle_fail = 0;
        bool     ping_ok_this_cycle = true;

        for (unsigned i = 0; i < SOAK_TEST_COUNT; ++i) {
            if (tests[i].quarantined) {
                if (cycle == 1u) {
                    printf("[hil-soak] QUARANTINED (known silicon defect, "
                           "see table comment): %s\n",
                           tests[i].stat.name);
                }
                continue;
            }
            if (tests[i].fn(&tests[i].stat)) {
                ++tests[i].stat.pass;
                ++cycle_pass;
            } else {
                ++tests[i].stat.fail;
                ++cycle_fail;
                if (i == 0u) ping_ok_this_cycle = false; /* tests[0] = ping */
            }
        }

        printf("[hil-soak] cycle %u | %u/%u PASS%s\n", cycle, cycle_pass, cycle_pass + cycle_fail,
               (cycle_fail != 0u) ? " <-- FAILURES THIS CYCLE" : "");

        /* Cumulative table every 16 cycles -- greppable soak verdict.
         * "SOAK-CLEAN" appears iff every ACTIVE test has zero failures
         * (quarantined entries are listed but don't gate the verdict). */
        if ((cycle % 16u) == 0u) {
            bool clean = true;
            printf("[hil-soak] ---- cumulative after %u cycles ----\n", cycle);
            for (unsigned i = 0; i < SOAK_TEST_COUNT; ++i) {
                const soak_stat_t *st = &tests[i].stat;
                if (tests[i].quarantined) {
                    printf("[hil-soak]   %-18s QUARANTINED\n", st->name);
                    continue;
                }
                if (st->fail != 0u) clean = false;
                printf("[hil-soak]   %-18s pass=%u fail=%u%s\n", st->name, st->pass, st->fail,
                       st->fail ? " <--" : "");
            }
            printf("[hil-soak] verdict: %s\n", clean ? "SOAK-CLEAN" : "SOAK-DIRTY");
        }

        /* Link-level recovery: PING failing two cycles in a row means
         * the transport (not an opcode) is wedged -- re-run the
         * blocking init, which re-PINGs until the GD32 answers.  A
         * single failed cycle rides on the driver's own per-call
         * CRC/retry handling and just counts. */
        if (!ping_ok_this_cycle) {
            if (++consecutive_ping_fails >= 2u) {
                printf("[hil-soak] transport wedged -- re-initialising the link\n");
                link_init_blocking(spi);
                consecutive_ping_fails = 0;
            }
        } else {
            consecutive_ping_fails = 0;
        }

        k_msleep(1000);
    }

    /* not reached */
    return 0;
}
